informe.tex
% Created 2020-06-20 Sat 23:33
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jesus Rodolfo Izurieta Veliz}
\date{\today}
\title{Inform sesión de programación 2. Node Js}
\hypersetup{
 pdfauthor={Jesus Rodolfo Izurieta Veliz},
 pdftitle={Inform sesión de programación 2. Node Js},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Introducción}
\label{sec:org22ee969}
Desarrollo de un servidor web que atienda peticiones de archivos con diferentes formatos (ASCII, JSON, HTML, PDF).
Los archivos estarán distribuidos en dos únicos directorios: \emph{pub y /doc).
Cuando el servidor reciba una petición GET con la ruta ‘/doc}', deberá recuperarlo desde el directorio /doc;
el mismo procedimiento deberá seguirse con la ruta ‘/pub'. Por ejemplo: /pub/test.html

El servidor deberá verificar si el archivo solicitado existe antes de recuperarlo,
de lo contrario deberá retornar una página comunicando esta condición de error (Codigo 404 – Not Found).
Use los módulos “http”, “url” y “fs” de Node.

\section{Desarrollo}
\label{sec:orgc9d682c}
Para la creación del servidor con NodeJs, usaremos algunos módulos de npm,
entre ellos, node, express, url y body-parser; los instalamos con el manejador de módulos npm.

\subsection{Módulo Url}
\label{sec:org89a6d9f}
El módulo url de node, nos provee utilidades para la resolución de urls.
Para esto, cuenta con la clase url, lo que añade atributos que no serían accesibles en el caso de usar únicamente cadenas de texto.

\subsection{Módulo fs}
\label{sec:orgd053c5b}
El módulo fs implementa una interfaz del sistema de archivos del sistema operativo para node,
de modo que con ayuda de fs seremos capaces de acceder a directorios y archivos de nuestro servidor.

\section{Pruebas}
\label{sec:org223f616}
Use un navegador para probar su servidor incluyendo distintos formatos y directorios.

Finalmente, escriba un informe sobre el trabajo realizado que deberá estar listo antes del domingo 21 de junio.
\end{document}
